<!--
 * @Description: 
 * @Author: lhl
 * @Date: 2019-08-14 16:37:55
 * @LastEditors: lhl
 * @LastEditTime: 2019-08-14 17:44:36
 -->
<template>
  <div class="detailStandard-box">
    <div>
      <p>1，所有弹出框可拖动；（使用指令：v-dialogDrag）</p>
      <p>2，所有表格点击行高亮，除非是多选，否则保持单行点击高亮，高亮色与左侧菜单选中色一致；（已全局控制选中颜色）</p>
      <p>3，所有按钮采用朴素风格，并且大小规定为small；</p>
      <p>4，所有查询统一风格，搜索名：关键字，搜索框占位符文字显示为可以搜索的所有字段名字；</p>
      <p>5，所有表格一行数据不可换行显示，如果文字过长，采用省略号格式，并悬浮时提示全部文字；</p>
      <p>6，所有表格渲染数据加载时，加loading，显示后关闭loading；</p>
      <p>7，多级表格嵌套，第三级表格不限高；</p>
      <p>8，表格最后一列为操作列，操作列必须固定，表格第一列，视情况是否固定；</p>
      <p>9，能在12寸屏幕下不显示横向滚动条的表格，尽量不显示横向滚动条；</p>
      <p>10，所有警告或错误提示，不可包含代码；</p>
      <p>11，所有表格头高度为36px，表格内容行高度为38px；</p>
      <p>12，所有页面，页面左侧是查询部分，右侧是功能按钮部分；</p>
      <p>13，所有弹出框内容，最小适应12寸屏幕各分辨率，尽量一屏显示，否则限制高度；</p>
      <p>14，弹出框内容，表单行要求label文字右对齐、输入框左对齐；对于大盒子框，表单左右居中显示；</p>
      <p>15，所有列表如果有操作列，则操作列在最后一列并且固定，操作列标题和内容居中，如果有状态列，则状态列在第二列并且固定，状态列标题和内容居中，如果有当前单据的单号，则单号在第一列并且固定，单号列标题和内容左对齐，并且单号可以超连接打开详情；除此之外的列，不固定，文本列的标题和内容全部左对齐，数字列的标题左对齐，数字列的内容右对齐。其中，整数规定8个数字宽度，小数11个数字宽度；</p>
      <p>16，多选用方正圈勾选，单选用圆圈选中；</p>
    </div>
  </div>
  </div>
</template>

<script>
export default {
  name: 'detailStandard',
  data() {
    return {

    }
  },
  props: [],
  components: {

  },
  methods: {

  },
  computed: {
    //computed比较适合对多个变量或者对象进行处理后返回一个结果值，也就是数多个变量中的某一个值发生了变化则我们监控的这个值也就会发生变化
    //computed用来监控自己定义的变量，该变量不在data里面声明(但和data定义的变量相关联，直接在computed里面定义

  },
  beforeCreate() {
    //在实例初始化之后，数据观测(data observer) 和 event/watcher 事件配置之前被调用。

  },
  created() {
    //数据观测(data observer)，属性和方法的运算， watch/event 事件回调。然而，挂载阶段还没开始，$el 属性目前不可见。

  },
  beforeMount() {
    //相关的 render 函数（模板）首次被调用

  },
  mounted() {
    //el 被新创建的 vm.$el 替换，并挂载到实例上去之后调用该钩子。

  },
  beforeUpdate() {
    //数据更新时调用，发生在虚拟 DOM 重新渲染和打补丁之前。

  },
  updated() {
    //由于数据更改导致的虚拟 DOM 重新渲染和打补丁，在这之后会调用该钩子。 
    //当这个钩子被调用时，组件 DOM 已经更新，所以你现在可以执行依赖于 DOM 的操作。
    //然而在大多数情况下，你应该避免在此期间更改状态，因为这可能会导致更新无限循环。 
    //该钩子在服务器端渲染期间不被调用。

  },
  beforeDestroy() {
    //实例销毁之前调用。在这一步，实例仍然完全可用。

  },
  destroyed() {
    //调用后，Vue 实例指示的所有东西都会解绑定，所有的事件监听器会被移除，所有的子实例也会被销毁。 该钩子在服务器端渲染期间不被调用。

  },
  watch: {
    // watch主要用于监控vue实例的变化，它监控的变量当然必须在data里面声明才可以，它可以监控一个变量，也可以是一个对象，且只能监控整个对象或单个变量;

  }
}
</script>
<style scoped lang="scss">
.detailStandard-box {
  h2 {
    text-align: center;
  }
  p {
    line-height: 22px;
    margin-bottom: 10px;
  }
}
</style>